ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
/* mbed
 * Copyright (c) 2006-2015 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */


#include "lesense/lesense_api.h"

#include "minar/minar.h"

#include "em_lesense.h"
#include "em_acmp.h"
#include "em_gpio.h"

#include "LESENSE_config.h"

#include "swo/swo.h"

#define printf swoprintf

namespace lesense {

uint16_t lesenseToActiveMap[NUM_LESENSE_CHANNELS];

/*  Setup and State Group
*/
typedef enum {
  STATE_PAUSE,
  STATE_IDLE,
  STATE_CALIBRATION,
  STATE_CALIBRATION_PAUSE,
  STATE_ACTIVE,
  STATE_ACTIVE_PAUSE
} state_t;

static state_t lesenseState = STATE_PAUSE;

static uint8_t  channelSensitivityPercent[NUM_ACTIVE_CHANNELS]  = {0};
static bool     alreadyPressed[NUM_ACTIVE_CHANNELS]             = {0};

static uint32_t scanFrequencyIdle   = LESENSE_SCAN_FREQUENCY_LOW;
static uint32_t scanFrequencyActive = LESENSE_SCAN_FREQUENCY_HIGH;
/* End Setup and State Group */

/*  Linked List Group
    Functions and datastructures for maintaining a linked list of callbacks
    for each channel.
*/
static struct   CallbackNode* onPress[NUM_ACTIVE_CHANNELS]      = {0};
static struct   CallbackNode* onRelease[NUM_ACTIVE_CHANNELS]    = {0};
static uint32_t currentUsers[NUM_ACTIVE_CHANNELS]               = {0};

/*  End Linked List Group */

/*  Calibration Group
    Functions and datastructures for handling calibration.
*/
static bool     useCalibrationValues = true;
static uint8_t  calibrationValueIndex = 0;
static uint16_t calibrationValue[NUM_ACTIVE_CHANNELS][NUMBER_OF_CALIBRATION_VALUES];
static uint16_t channelMaxValue[NUM_ACTIVE_CHANNELS];
static uint16_t channelMinValue[NUM_ACTIVE_CHANNELS];
static uint16_t channelCalValue[NUM_ACTIVE_CHANNELS];
static uint16_t GetMedianValue(uint16_t* A, uint16_t N);
FunctionPointer calibrateDoneCallback;
/*  End Calibration Group */

/*  IRQ Group
    Datastructures for transferring data between interrupt handler and tasks.
*/
static uint16_t channelsUsedMask                        = 0;
static uint16_t numChannelsUsed                         = 0;
static uint32_t lastEvent[2]                            = {0};
static uint32_t lastScanres[2]                          = {0};
static uint16_t transferBuffer[2][NUM_ACTIVE_CHANNELS]  = {0};
static uint8_t  TRANSFER_BUFFER_BANK                    = 0;

static bool calibrationTaskNotPosted    = true;
static bool scanCompleteTaskNotPosted   = true;
static bool buttonWakeupTaskNotPosted   = true;
/*  End IRQ Group */



/*  Private function for initializing the lesense module. */
void lesenseInit()
{
    printf("lesenseInit\r\n");

    for(uint16_t activeChannel = 0;
        activeChannel < NUM_ACTIVE_CHANNELS;
        activeChannel++)
    {
        /* Init min and max values for each active channel */
        channelMaxValue[activeChannel] = 0;
        channelCalValue[activeChannel] = 0;
        channelMinValue[activeChannel] = 0xffff;
        channelSensitivityPercent[activeChannel] = 100;
    }

    /*  The lesenseChannel is always less than NUM_LESENSE_CHANNELS.
        Use NUM_LESENSE_CHANNELS to indicate channel is not in use.
    */
    for (uint32_t lesenseChannel = 0;
         lesenseChannel < NUM_LESENSE_CHANNELS;
         lesenseChannel++)
    {
        lesenseToActiveMap[lesenseChannel] = NUM_LESENSE_CHANNELS;
    }

    ///////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////

    /* Setup CMU. */
    /* ACMP */
    CMU_ClockEnable(cmuClock_ACMP0, true);
    CMU_ClockEnable(cmuClock_ACMP1, true);

    /* GPIO */
    CMU_ClockEnable(cmuClock_GPIO, true);

    /* Low energy peripherals
    *   LESENSE
    *   LFXO clock must be enabled prior to enabling
    *   clock for the low energy peripherals */
    CMU_ClockSelectSet(cmuClock_LFA, cmuSelect_LFXO);
    CMU_ClockEnable(cmuClock_CORELE, true);
    CMU_ClockEnable(cmuClock_LESENSE, true);

    /* Disable clock source for LFB clock */
    CMU_ClockSelectSet(cmuClock_LFB, cmuSelect_Disabled);

    ///////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////

    /* Setup ACMP. */
    /* Configuration structure for ACMP */
    /* See application note document for description of the different settings. */
    static const ACMP_CapsenseInit_TypeDef acmpInit =
    {
        .fullBias                 = true,            //Configured according to application note
        .halfBias                 = true,            //Configured according to application note
        .biasProg                 = 0x5,             //Configured according to application note
        .warmTime                 = acmpWarmTime512, //LESENSE uses a fixed warmup time
        .hysteresisLevel          = acmpHysteresisLevel5, //Configured according to application note
        .resistor                 = acmpResistor0,   //Configured according to application note
        .lowPowerReferenceEnabled = false,           //LP-reference can introduce glitches with captouch
        .vddLevel                 = 0x30,            //Configured according to application note
        .enable                   = false            //LESENSE enables the ACMP
    };

    /* Initialize ACMP in capsense mode*/
    ACMP_CapsenseInit(ACMP0, &acmpInit);
    ACMP_CapsenseInit(ACMP1, &acmpInit);

    ///////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////

    /* Setup LESENSE. */
    /* LESENSE configuration structure */
    static const LESENSE_Init_TypeDef initLesense =
    {
        .coreCtrl         =
        {
            .scanStart    = lesenseScanStartPeriodic,
            .prsSel       = lesensePRSCh0,
            .scanConfSel  = lesenseScanConfDirMap,
            .invACMP0     = false,
            .invACMP1     = false,
            .dualSample   = false,
            .storeScanRes = false,
            .bufOverWr    = true,
            .bufTrigLevel = lesenseBufTrigHalf,
            .wakeupOnDMA  = lesenseDMAWakeUpDisable,
            .biasMode     = lesenseBiasModeDutyCycle,
            .debugRun     = false
        },

