ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
        .timeCtrl         =
        {
            .startDelay   = 0x0
        },

        .perCtrl            =
        {
            .dacCh0Data     = lesenseDACIfData,
            .dacCh0ConvMode = lesenseDACConvModeDisable,
            .dacCh0OutMode  = lesenseDACOutModeDisable,
            .dacCh1Data     = lesenseDACIfData,
            .dacCh1ConvMode = lesenseDACConvModeDisable,
            .dacCh1OutMode  = lesenseDACOutModeDisable,
            .dacPresc       = 0,
            .dacRef         = lesenseDACRefBandGap,
            .acmp0Mode      = lesenseACMPModeMux,   // only acmp mux controlled by lesense
            .acmp1Mode      = lesenseACMPModeMux,   // only acmp mux controlled by lesense
            .warmupMode     = lesenseWarmupModeNormal
        },

        .decCtrl       =
        {
            .decInput  = lesenseDecInputSensorSt,
            .initState = 0,
            .chkState  = false,
            .intMap    = false,
            .hystPRS0  = false,
            .hystPRS1  = false,
            .hystPRS2  = false,
            .hystIRQ   = false,
            .prsCount  = false,
            .prsChSel0 = lesensePRSCh0,
            .prsChSel1 = lesensePRSCh1,
            .prsChSel2 = lesensePRSCh2,
            .prsChSel3 = lesensePRSCh3
        }
    };

    /* Initialize LESENSE interface _with_ RESET. */
    LESENSE_Init(&initLesense, true);

    /* Set clock divisor for LF clock. */
    LESENSE_ClkDivSet(lesenseClkLF, lesenseClkDiv_1);

    printf("%s done\r\n", __FUNCTION__);
}





/*  Add channel
*/
void addChannel(params_t& params)
{
    uint16_t activeChannel = lesenseToActiveMap[params.channel];

    /*  Sanity check. activeChannel == NUM_LESENSE_CHANNELS means the
        channel has not been configured for use and it can only be
        configured if there are available active channel slots.
    */
    MBED_ASSERT((params.channel >= NUM_LESENSE_CHANNELS) ||
        (numChannelsUsed >= NUM_ACTIVE_CHANNELS && activeChannel == NUM_LESENSE_CHANNELS));

    /*  The same channel can be added multiple times. This is useful if multiple
        modules want to be notified about user interaction.

        Callbacks are stored as linked lists. See the gpio-efm32 module for details.
    */
    if (activeChannel == NUM_LESENSE_CHANNELS)
    {
        /*  Keep track of channels in use, users per channel, and maintain mapping
        between active channelse and lesense channelse. The usage mask is for
        setting and reading interrupt registers.
        */
        activeChannel = numChannelsUsed;
        numChannelsUsed++;
        lesenseToActiveMap[params.channel] = activeChannel;
        currentUsers[activeChannel]++;
        channelsUsedMask |= (1 << params.channel);

        /* Store channel sensitivity for later calibration. */
        channelSensitivityPercent[activeChannel] = params.sensitivity;

        /* Set GPIO pin mode to disabled for all active pins */
        GPIO_PinModeSet(LESENSE_CH_PORT, params.channel, gpioModeDisabled, 0);

        /* Channel configuration */
        static const LESENSE_ChDesc_TypeDef initLesenseCh =
        {
            .enaScanCh     = true,
            .enaPin        = true,
            .enaInt        = true,
            .chPinExMode   = lesenseChPinExDis,
            .chPinIdleMode = lesenseChPinIdleDis,
            .useAltEx      = false,
            .shiftRes      = false,
            .invRes        = false,
            .storeCntRes   = true,
            .exClk         = lesenseClkLF,
            .sampleClk     = lesenseClkLF,
            .exTime        = 0x0,
            .sampleDelay   = SAMPLE_DELAY,
            .measDelay     = 0x0,
            .acmpThres     = 0x0,                   // don't care, configured by ACMPInit
            .sampleMode    = lesenseSampleModeCounter,
            .intMode       = lesenseSetIntLevel,
            .cntThres      = 0x0,                   // Configured later by calibration function
            .compMode      = lesenseCompModeLess
        };

        /* Configure channel */
        LESENSE_ChannelConfig(&initLesenseCh, params.channel);

        /* start calibration */
        calibrate(true, true, NULL);
    }

    /* registed call back functions. */
    if (params.onPress)
    {
        addCallback(params.onPress, params.updates, &onPress[activeChannel]);
    }

    if (params.onRelease)
    {
        addCallback(params.onRelease, params.updates, &onRelease[activeChannel]);
    }
}




uint16_t getValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return transferBuffer[TRANSFER_BUFFER_BANK ^ 0x01][activeChannel];
}

uint16_t getMinValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return channelMinValue[activeChannel];
}

uint16_t getMaxValue(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    return channelMaxValue[activeChannel];
}

uint32_t getEventTimestamp()
{
    return lastEvent[TRANSFER_BUFFER_BANK ^ 0x01];
}

bool channelIsActive(uint32_t lesenseChannel)
{
  uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

  return alreadyPressed[activeChannel];
}








/*  Update the sampling frequency used when the module is in the idle state,
    i.e., none of the channels are above the specified threshold.
*/
void setIdleFrequency(uint32_t freqHz)
{
    if (scanFrequencyIdle != freqHz)
    {
        scanFrequencyIdle = freqHz;

        if (lesenseState == STATE_IDLE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        }
        else if (lesenseState == STATE_ACTIVE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyActive);
        }
    }
}

/*  Update the sampling frequency used when the module is in the active state,
    i.e., when at least one of the channels is below the threshold.
*/
void setActiveFrequency(uint32_t freqHz)
{
    if (scanFrequencyActive != freqHz)
    {
        scanFrequencyActive = freqHz;

        if (lesenseState == STATE_IDLE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        }
        else if (lesenseState == STATE_ACTIVE)
        {
            LESENSE_ScanFreqSet(0, scanFrequencyActive);
        }
    }
}

uint16_t getCalibrationValueForChannel(uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

