ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
    return channelCalValue[activeChannel];
}

void setMaxValue(uint16_t maxValue, uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    channelMaxValue[activeChannel] = maxValue;
}

void setMinValue(uint16_t minValue, uint32_t lesenseChannel)
{
    uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

    channelMinValue[activeChannel] = minValue;
}

void setThreshold(uint16_t threshold, uint32_t lesenseChannel)
{
    LESENSE_ChannelThresSet(lesenseChannel, 0x0, threshold);
}

/*  Initiate calibration. The force flag will interrupt the current
    activity otherwise calibration will only commence when idle.
    The call back is called when calibration is complete.
*/
void calibrate(bool forceCalibration, bool useNewValues, void (*callback)(void))
{
    calibrateDoneCallback.attach(callback);

    internalCalibrate(forceCalibration, useNewValues);
}

void internalCalibrate(bool forceCalibration, bool useNewValues)
{
    if ((lesenseState == STATE_PAUSE) ||
        (lesenseState == STATE_IDLE) ||
        ((lesenseState == STATE_ACTIVE) && forceCalibration))
    {
        LESENSE_ScanStop();

        /* Wait for current scan to finish */
        while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

        LESENSE_ResultBufferClear();

        LESENSE_IntDisable(channelsUsedMask);
        LESENSE_IntClear(_LESENSE_IFC_MASK);
        LESENSE_IntEnable(LESENSE_IEN_SCANCOMPLETE);
        NVIC_EnableIRQ(LESENSE_IRQn);

        LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        LESENSE_ScanStart();

        if (lesenseState == STATE_PAUSE)
        {
            lesenseState = STATE_CALIBRATION_PAUSE;
        }
        else
        {
            lesenseState = STATE_CALIBRATION;
        }

        useCalibrationValues = useNewValues;

        printf("calibration\n");
    }
    else if ((lesenseState == STATE_CALIBRATION) ||
             (lesenseState == STATE_CALIBRATION_PAUSE))
    {
        printf("calibration in progress\n");

        // retake measurements
        calibrationValueIndex  = 0;

        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
    else
    {
        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
}



void pause()
{
    // WARNING: should this be in a minar task?
    if (lesenseState == STATE_ACTIVE)
    {
        lesenseState = STATE_ACTIVE_PAUSE;
    }
    else if ((lesenseState == STATE_CALIBRATION) ||
             (lesenseState == STATE_CALIBRATION_PAUSE))
    {
        lesenseState = STATE_CALIBRATION_PAUSE;
    }
    else
    {
        lesenseState = STATE_PAUSE;
        LESENSE_ScanStop();
    }
}

void resume()
{
    if (lesenseState == STATE_ACTIVE_PAUSE)
    {
        lesenseState = STATE_ACTIVE;
    }
    else if (lesenseState == STATE_CALIBRATION_PAUSE)
    {
        lesenseState = STATE_CALIBRATION;
    }
    else if (lesenseState == STATE_PAUSE)
    {
        /* restore interrupts to channel/threshold */
        LESENSE_ScanStop();

        /* Wait for current scan to finish */
        while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

        LESENSE_IntDisable(LESENSE_IEN_SCANCOMPLETE);
        LESENSE_IntClear(_LESENSE_IFC_MASK);
        LESENSE_IntEnable(channelsUsedMask);
        NVIC_EnableIRQ(LESENSE_IRQn);

        lesenseState = STATE_IDLE;

        LESENSE_ScanFreqSet(0, scanFrequencyIdle);
        LESENSE_ScanStart();
    }
}




/*  addCallback, removeCallback, and cleanupCallback maintain the linkedlists
    with call back functions.
*/
bool addCallback(FunctionPointer& newCallback, bool updates, struct CallbackNode** node)
{
    /* insert new node at the end of the linked list */
    while(*node)
    {
        node = &((*node)->next);
    }

    *node = (struct CallbackNode*) calloc(1, sizeof (struct CallbackNode));

    if(!*node)
    {
        return false;
    }

    (*node)->multipleUpdates = updates;
    (*node)->callback = newCallback;

    return true;
}

bool removeCallback(FunctionPointer& oldCallback, struct CallbackNode** node)
{
    while(*node)
    {
        if ((*node)->callback == oldCallback)
        {
            void* trashNode = *node;
            *node = (*node)->next;
            free(trashNode);

            return true;
        }

        node = &((*node)->next);
    }

    return false;
}

void cleanupCallback(struct CallbackNode** node)
{
    while(*node)
    {
        void* trashNode = *node;
        *node = (*node)->next;
        free(trashNode);

        node = &((*node)->next);
    }
}



/****************************************************************************
 * Returns median value in input array of size N
*****************************************************************************/

static inline int compare(const void* one, const void* two)
{
    return (*((uint16_t*)one) < *((uint16_t*)two)) ? -1 : 1;
}

static uint16_t GetMedianValue(uint16_t* A, uint16_t N)
{
#warning Using recursive q-sort. Switch to shellsort.
    qsort(A, N, sizeof(uint16_t), compare);

    return A[N/2];
}

/**************************************************************************//**
 * @brief LESENSE_IRQHandler
 * Interrupt Service Routine for LESENSE Interrupt Line
 *****************************************************************************/

/*  The IRQ flow is designed around the states: IDLE, ACTIVE, and CALIBRATING.
    In IDLE state the lesense module is in charge of sampling, and interrupts
    are only triggered when a channel's value drops below the preset
    threshold. Once that happens, the buttonWakeupTask is posted. In this task
    the sampling rate is increased and the module enters ACTIVE mode.

    Interrupts in ACTIVE mode and CALIBRATING mode causes all channels to be
    sampled and have their values transferred using the transferBuffer. The
    calibrationTask and scanCompleteTask processes the transferBuffer so the
    interrupt handler can return as soon as possible. The minValue for each
    channel is updated as well.

