ARMmbed/wrd-touch-efm32/source/lesense_api.cpp
    In the scanCompleteTask, all channels with values lower than the threshold
    will have their onPress callback's called and those that have previously
    been called but have now returned to values above the threshold have their
    onRelease callbacks called.

    In the calibrationTask, all channels are sampled for
    NUMBER_OF_CALIBRATION_VALUES using multiple rounds of interrupts. Once
    completed, the median value for each channel is found and used as the
    maxValue observed. Each channel's threshold is set based on the
    sensitivity and the maxValue. The minValue is reset to maxValue.
*/

static void calibrationTask()
{
    NVIC_DisableIRQ(LESENSE_IRQn);
    TRANSFER_BUFFER_BANK ^= 0x01;
    NVIC_EnableIRQ(LESENSE_IRQn);

    /* Iterate through all possible channels, but only store the active ones. */
    for(uint32_t lesenseChannel = 0;
        lesenseChannel < NUM_LESENSE_CHANNELS;
        lesenseChannel++)
    {
        if((channelsUsedMask >> lesenseChannel) & 0x01)
        {
            uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

            calibrationValue[activeChannel][calibrationValueIndex] =
                transferBuffer[TRANSFER_BUFFER_BANK ^ 0x01][activeChannel];
        }
    }

    /* Wrap around calibrationValueIndex */
    calibrationValueIndex++;
    if(calibrationValueIndex >= NUMBER_OF_CALIBRATION_VALUES)
    {
        /* Calculate max/min-value for each channel and set threshold */
        for(uint32_t lesenseChannel = 0;
            lesenseChannel < NUM_LESENSE_CHANNELS;
            lesenseChannel++)
        {
            if((channelsUsedMask >> lesenseChannel) & 0x1)
            {
                uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

                /* Store the median. */
                channelCalValue[activeChannel] = GetMedianValue(calibrationValue[activeChannel], NUMBER_OF_CALIBRATION_VALUES);

                /*  The median can either be used automatically
                    or the thresholds can be set manually.
                */
                if (useCalibrationValues)
                {
                    /* reset the min-max values to use the median calibration value. */
                    uint16_t nominalCount = channelCalValue[activeChannel];
                    channelMaxValue[activeChannel] = nominalCount;
                    channelMinValue[activeChannel] = nominalCount;

                    /* use the new max-value to set threshold based on sensitivity. */
                    uint16_t channelThreshold = ((uint32_t)nominalCount *
                                                (uint32_t)channelSensitivityPercent[activeChannel]) / 100;
                    LESENSE_ChannelThresSet(lesenseChannel, 0x0, channelThreshold);

                    printf("%d %d\n", (int) lesenseChannel, (int) channelThreshold);
                }
            }
        }

        /* calibration done, switch back to normal mode */
        calibrationValueIndex = 0;

        LESENSE_ScanStop();

        /* If pause has been called during calibration, do not start. */
        if (lesenseState == STATE_CALIBRATION_PAUSE)
        {
            lesenseState = STATE_PAUSE;
        }
        else
        {
            lesenseState = STATE_IDLE;

            /* Wait for current scan to finish */
            while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

            /* restore interrupts to channel/threshold */
            LESENSE_IntDisable(LESENSE_IEN_SCANCOMPLETE);
            LESENSE_IntClear(_LESENSE_IFC_MASK);
            LESENSE_IntEnable(channelsUsedMask);
            LESENSE_ScanFreqSet(0, scanFrequencyIdle);
            LESENSE_ScanStart();
        }

        printf("calibration done\n");

resume();

        if (calibrateDoneCallback)
        {
            minar::Scheduler::postCallback(calibrateDoneCallback)
                .tolerance(0);
        }
    }
    else
    {
        printf("calibrating\n");
    }

    NVIC_DisableIRQ(LESENSE_IRQn);
    calibrationTaskNotPosted = true;
    NVIC_EnableIRQ(LESENSE_IRQn);
}


static uint32_t oldCount = 0;

static void buttonWakeupTask()
{
    uint32_t newCount = RTC->CNT;
    printf("%s %d\r\n", __FUNCTION__, (int)(newCount - oldCount));
    oldCount = newCount;

    /* Wait for current scan to finish */
    while(LESENSE->STATUS & LESENSE_STATUS_SCANACTIVE);

    LESENSE_ResultBufferClear();
    LESENSE_IntClear(_LESENSE_IFC_MASK);
    LESENSE_IntEnable(LESENSE_IEN_SCANCOMPLETE);
    LESENSE_ScanFreqSet(0, scanFrequencyActive);

    NVIC_DisableIRQ(LESENSE_IRQn);
    buttonWakeupTaskNotPosted = true;
    NVIC_EnableIRQ(LESENSE_IRQn);
}


static void scanCompleteTask()
{
    // debug timing measurement
    uint32_t newCount = RTC->CNT;
    printf("%s %d\r\n", __FUNCTION__, (int)(newCount - oldCount));
    oldCount = newCount;

    NVIC_DisableIRQ(LESENSE_IRQn);
    TRANSFER_BUFFER_BANK ^= 0x01;
    NVIC_EnableIRQ(LESENSE_IRQn);

    uint32_t localScanres = 0;

    /*  Read the latest scan result if "pause" has not been called.
        If "pause" has been requested, ignore the latest scan results which will
        emulate all the channels being released and trigger the appropriate
        callbacks.
    */
    if (lesenseState != STATE_ACTIVE_PAUSE)
    {
        localScanres = lastScanres[TRANSFER_BUFFER_BANK ^ 0x01];
    }

    for(uint32_t lesenseChannel = 0;
        lesenseChannel < NUM_LESENSE_CHANNELS;
        lesenseChannel++)
    {
        uint16_t activeChannel = lesenseToActiveMap[lesenseChannel];

        if (activeChannel != NUM_LESENSE_CHANNELS)
        {
            // threshold reached for this channel, i.e., button was pressed
            if (((localScanres & channelsUsedMask) >> lesenseChannel) & 0x01)
            {
                if (alreadyPressed[activeChannel] == false)
                {
                    alreadyPressed[activeChannel] = true;

                    /* go through all single call callbacks (and other callbacks) */
                    struct CallbackNode* node = onPress[activeChannel];
                    while(node)
                    {
                        minar::Scheduler::postCallback(node->callback)
                            .tolerance(0);

